package l2s.gameserver.skills;

/**
 * @author Bonux
**/
public enum AbnormalEffect
{
	// Normal Abnormal Effects
	/*0*/NONE,
	/*1*/DOT_BLEEDING,
	/*2*/DOT_POISON,
	/*3*/DOT_FIRE, // Мигает красный круг вокруг живота персонажа.
	/*4*/DOT_WATER, // Висит и мигает кусок для на животе персонажа.
	/*5*/DOT_WIND,
	/*6*/DOT_SOIL, // Из персонажа появляется куча бардового дыма и зеленькие кружочки.
	/*7*/STUN,
	/*8*/SLEEP,
	/*9*/SILENCE,
	/*10*/ROOT,
	/*11*/PARALYZE,
	/*12*/FLESH_STONE,
	/*13*/DOT_MP, //unk
	/*14*/BIG_HEAD,
	/*15*/DOT_FIRE_AREA, // Пламя огня начиная с ног персонажа.
	/*16*/CHANGE_TEXTURE,
	/*17*/BIG_BODY,
	/*18*/FLOATING_ROOT,
	/*19*/DANCE_ROOT,
	/*20*/GHOST_STUN, // Звездочки как у стана и на ногах красный круг.
	/*21*/STEALTH,
	/*22*/SEIZURE1, // Вокруг живота синий туман с электричеством.
	/*23*/SEIZURE2, // Вокруг живота синий туман с электричеством.
	/*24*/MAGIC_SQUARE,
	/*25*/FREEZING, // Висит и мигает кусок для на животе персонажа.
	/*26*/SHAKE, // Землетрясение.
	/*27*/UNK_27, //unk
	/*28*/ULTIMATE_DEFENCE,
	/*29*/VP_UP,
	/*30*/REAL_TARGET,
	/*31*/DEATH_MARK,
	/*32*/TURN_FLEE, // Синяя морда черепа над головой.
	/*33*/INVINCIBILITY,
	/*34*/AIR_BATTLE_SLOW, // Мигает красный туманный шар вокруг живота персонажа.
	/*35*/AIR_BATTLE_ROOT,  // Мигает красный туманный шар вокруг живота персонажа.
	/*36*/CHANGE_WP, // Багет вместо оружия.
	/*37*/CHANGE_HAIR_G, // Золотая афро-прическа.
	/*38*/CHANGE_HAIR_P, // Розовая афро-прическа.
	/*39*/CHANGE_HAIR_B, // Черная афро-прическа.
	/*40*/UNK_40, // unk
	/*41*/STIGMA_OF_SILEN,
	/*42*/SPEED_DOWN, // Зеленые и белые линии запутуются в ногах.
	/*43*/FROZEN_PILLAR,
	/*44*/CHANGE_VES_S, // Переодевает персонажа в золотой веспер.
	/*45*/CHANGE_VES_C, // Переодевает персонажа в золотой веспер.
	/*46*/CHANGE_VES_D, // Переодевает персонажа в белый веспер.
	/*47*/TIME_BOMB, // Зеленый круговой дождь в тумане над головой персонажа.
	/*48*/MP_SHIELD, // Критует клиент хD
	/*49*/AIRBIND, // Поднимает в верх и держит в красном шаре персонажа.
	/*50*/CHANGEBODY, // Переодевает персонажа в Д грейд.
	/*51*/KNOCKDOWN,
	/*52*/NAVIT_ADVENT, //當機
	/*53*/KNOCKBACK,
	/*54*/CHANGE_7ANNIVERSARY,//D裝外型
	/*55*/ON_SPOT_MOVEMENT, //unk
	/*56*/DEPORT, //角色被關閉在黑色牢籠
	/*57*/AURA_BUFF, // С персонажа идет зеленый дым и сверкает живот.
	/*58*/AURA_BUFF_SELF, // С персонажа идет бело-желтый дым, вокруг живота идут вспышки кольцами градиентного цвета и вокруг живота летают белые кружочки. Также персонаж стоит на красном круге.
	/*59*/AURA_DEBUFF, // С персонажа мигает красный дым и сверкает живот красными полосами.
	/*60*/AURA_DEBUFF_SELF, // Персонажа окутывают красные спиральные полосы и мигает не сильно красный дым. (При активации происходит красная вспышка)
	/*61*/HURRICANE, // (При активации происходит бело-желтая вспышка)
	/*62*/HURRICANE_SELF, // Вокруг персонажа песчаная буря.
	/*63*/BLACK_MARK, // Над головой персонажа морда красного черепа.
	/*64*/BR_SOUL_AVATAR,//壺精發出紅光
	/*65*/CHANGE_GRADE_B, //B裝外型
	/*66*/BR_BEAM_SWORD_ONEHAND,
	/*67*/BR_BEAM_SWORD_DUAL,
	/*68*/D_NOCHAT,
	/*69*/D_HERB_POWER,
	/*70*/D_HERB_MAGIC,
	/*71*/D_TALI_DECO_P,//禁墓護身符
	/*72*/UNK_72,
	/*73*/D_TALI_DECO_C, // Рука светится желтым.
	/*74*/D_TALI_DECO_D, // Рука светится красным.
	/*75*/D_TALI_DECO_E, // Рука светится синим.
	/*76*/D_TALI_DECO_F, // Рука светится Фиолетовым.
	/*77*/D_TALI_DECO_G, // Переодевает в Топ S80, одевает плащ и диадему.
	/*78*/D_CHANGESHAPE_TRANSFORM_1, // Переодевает в NG.
	/*79*/D_CHANGESHAPE_TRANSFORM_2, // Переодевает в D.
	/*80*/D_CHANGESHAPE_TRANSFORM_3, // Переодевает в C.
	/*81*/D_CHANGESHAPE_TRANSFORM_4, //貴族白色
	/*82*/D_CHANGESHAPE_TRANSFORM_5, //A裝外型
	/*83*/UNK_83, // У артеас изчезает туловище, на остальных не проверялось.
	/*84*/UNK_84, //藍色泳裝
	/*85*/SANTA_SUIT, //聖誕服
	/*86*/UNK_86, // 角色頭附近漂浮 撲克牌
	/*87*/NC_DINOS, // NC服裝
	/*88*/LOVE_POTION, // 情人節武器
	/*89*/CHOCOLATE,	// 棒棒糖在角色附近飛行
	/*90*/CANDY,	// 糖果在角色附近飛行
	/*91*/COOKIE,	// 曲奇餅乾在角色附近飛行
	/*92*/EMPTY_STARS,	// Над персонажом засвечивается 5 пустых звездочек.
	/*93*/ONE_STAR,	// Над персонажом засвечивается 1я звездочка.
	/*94*/TWO_STARS,	// Над персонажом засвечивается 2я звездочка.
	/*95*/THREE_STARS,	// Над персонажом засвечивается 3я звездочка.
	/*96*/FOUR_STARS,	// Над персонажом засвечивается 4я звездочка.
	/*97*/FIVE_STARS,	// Над персонажом засвечивается 5я звездочка.
	/*98*/FACEOFF,	// Песронаж стоит в бардовом круге и над головой мигают скрещенные 2 меча.
	/*99*/UNK_99,	// Под персонажем земля пытается замерзнуть и выростает перед ногами небольшая льдинка.
	/*100*/UNK_100,	// Переодевает персонажа в бронь робокопа.
	/*101*/UNK_101,	// Возле персонажа летает голова посоха Мастера Йоды.
	/*102*/UNK_102,	// 音符在角色附近飛行
	/*103*/UNK_103,	// 音符在角色附近飛行
	/*104*/UNK_104,	// 音符在角色附近飛行
	/*105*/UNK_105,	// LineageII.在角色附近飛行
	/*106*/STOCKING_FAIRY,	// 聖誕襪子 在角色附近飛行
	/*107*/TREE_FAIRY,	// 聖誕樹 在角色附近飛行
	/*108*/SNOWMAN_FAIRY,	// 雪人 在角色附近飛行
	/*109*/UNK_109,	// 角色頭頂 產生暈眩的光圈
	/*110*/UNK_110,	// 發光的保護膜
	/*111*/UNK_111,	// Вокруг персонажа образовывается бардовая стена с синими бликами.
	/*112*/UNK_112,	// Вокруг персонажа крутятся зеленые круги в сверичном виде.
	/*113*/UNK_113,	// Над головой светится красное око.
	/*114*/STIGMA_STORM,	// Над головой светится зеленое око.
	/*115*/GREEN_SPEED_UP,	// Персонаж светиться зеленым и при беге подпрыгивает.
	/*116*/RED_SPEED_UP,	// Персонаж светиться красным и при беге подпрыгивает.
	/*117*/WIND_PROTECTION,	// Персонаж светиться в зеленый и стоит с транной агрессивной стойке.
	/*118*/LOVE,	// Начинает летать сердце над головой.
	/*119*/PERFECT_STORM,	// На уровне пояса синенький маленький круговорот воздуха.
	/*120*/UNK_120,	// Светиться синим и вокруг небольшой смерчь с листьями.
	/*121*/UNK_121,	// Темнеет персонаж с красным бликом.
	/*122*/UNK_122,
	/*123*/GREAT_GRAVITY,	// Темнеет персонаж с красной димной сверой в районе живота.
	/*124*/STEEL_MIND,	// Каждая нога окутывается зелеными полосами с звездочками и при беге подпрыгивает персонаж.
	/*125*/UNK_125,	// Вокруг персонажа ниже пояса летает черная и голубая цепь. Происходят синие вспышки.
	/*126*/OBLATE,	// Персонаж становится 2D. Сплюснутый))
	/*127*/SPALLATION,	// Персонаж оказывается в средине большого зеленого бликующего круга.
	/*128*/U_HE_ASPECT_AVE,	// С персонажа идет черный дым.
	/*129*/UNK_129,	// У артеас изчезает туловище, на остальных не проверялось.
	/*130*/UNK_130,	// У артеас изчезает туловище, на остальных не проверялось.
	/*131*/UNK_131,	// У артеас изчезает туловище, на остальных не проверялось.
	/*132*/UNK_132,	// Переодевает персонажа в бронь робокопа.
	/*133*/UNK_133,	//女僕
	/*134*/UNK_134,	//紅色泳裝
	/*135*/UNK_135,	// Оружие меняет на лазерное.
	/*136*/UNK_136,	// Оружие меняет на японское.
	/*137*/UNK_137,
	/*138*/UNK_138,
	/*139*/UNK_139,
	/*140*/UNK_140,
	/*141*/U_AVE_PALADIN_DEF,	// Вокруг персонажа крутятся светащиеся оранжевые щиты.
	/*142*/U_AVE_GUARDIAN_DEF,	// Вокруг персонажа крутятся светащиеся синие щиты.
	/*143*/U_REALTAR2_AVE,	// Над головой мигает красно-оранжевый оберег в виде тризуба.
	/*144*/U_AVE_DIVINITY,	// Персонажа переливается как эффект заточенной брони.
	/*145*/U_AVE_SHILPROTECTION,	// Вокруг персонажа образовывается красная сфера состоящая из шестиугольников.
	/*146*/U_EVENT_STAR_CA,	// Над персонажем мигают 5 звезд.
	/*147*/U_EVENT_STAR1_TA,	// Над персонажем появляется 1 звезда.
	/*148*/U_EVENT_STAR2_TA,	// Над персонажем появляется 2 звезда.
	/*149*/U_EVENT_STAR3_TA,	// Над персонажем появляется 3 звезда.
	/*150*/U_EVENT_STAR4_TA,	// Над персонажем появляется 4 звезда.
	/*151*/U_EVENT_STAR5_TA,	// Над персонажем появляется 5 звезда.
	/*152*/U_AVE_ABSORB_SHIELD,	// Вокруг персонажа образовывается белая сфера состоящая из шестиугольников.
	/*153*/U_KN_PHOENIX_AURA,	// Перед персонажем образовывается сферичный крест белый и исчезает.
	/*154*/U_KN_REVENGE_AURA,	// Над персоажем происходит фиолетовая дымовая вспышка и исчезает.
	/*155*/U_KN_EVAS_AURA,	// Из тела персонажа идет синий дымок, но в начале крутятся вокруг него синий цилиндр из шестиугольников.
	/*156*/U_KN_REMPLA_AURA,	// Из тела персонажа идет синий дымок, но в начале над ним появляются мечи.
	/*157*/U_AVE_LONGBOW,	// На оружии происходит белая вспышка и исчезает.
	/*158*/U_AVE_WIDESWORD,	// Оружие цилиндрично светиться радужными цветами.
	/*159*/U_AVE_BIGFIST,	// Кастеты светятся почти как геройские.
	/*160*/U_AVE_SHADOWSTEP,
	/*161*/U_TORNADO_AVE,
	/*162*/U_AVE_SNOW_SLOW,
	/*163*/U_AVE_SNOW_HOLD,
	/*164*/UNK_164,
	/*165*/U_AVE_TORNADO_SLOW,
	/*166*/U_AVE_ASTATINE_WATER,//湧起的泉水噴到空中
	/*167*/U_BIGBD_CAT_NPC,
	/*168*/U_BIGBD_UNICORN_NPC,
	/*169*/U_BIGBD_DEMON_NPC,
	/*170*/U_BIGBD_CAT_PC,
	/*171*/U_BIGBD_UNICORN_PC,
	/*172*/U_BIGBD_DEMON_PC,
	/*173*/U_AVE_DRAGON_ULTIMATE(700),
	/*174*/UNK_174,	//變小
	/*175*/PIRATE_SUIT,	//劫掠者
	/*176*/DARK_ASSASSIN_SUIT,	//黑暗刺客
	/*177*/WHITE_ASSASSIN_SUIT,	//雪白刺客
	/*178*/UNK_178,	// мушкетер
	/*179*/UNK_179,	// чародей в бардовом какой-то
	/*180*/UNK_180,	// джентельмен в цилиндре

	//TODO: Подобрать.
	/*181*/BR_POWER_OF_EVA(0),//保護膜
	/*182*/VP_KEEP(29),//萬聖節
	
	/*183*/UNK_183,//保護膜
	/*184*/UNK_184,//保護膜
	/*185*/UNK_185,//保護膜
	/*186*/UNK_186,//保護膜
	/*187*/UNK_187,//保護膜
	/*188*/UNK_188,//無效果
	/*189*/UNK_189,//無效果
	/*190*/BAIUM_TALISMAN,//巴溫護身符
	/*191*/BLUE_DYNASTY,//藍色王朝
	/*192*/RED_ZUBEI,//紅色夏隆
	/*193*/UNK_193,//紅色步兵衣裳
	/*194*/UNK_194,//一團火燃燒角色
	/*195*/UNK_195,//一圈黃色能量在被角色吸收的樣子
	/*196*/DARK_KNIGHT,//黑暗騎士
	/*197*/UNK_197,//特級效果沉默
	/*198*/UNK_198,//特級效果恐懼
	/*199*/UNK_199,//特級效果恐懼
	/*200*/UNK_200,//佩戴項鍊的感覺
	/*201*/UNK_201,//佩戴項鍊的感覺
	/*202*/UNK_202,//無效果
	/*203*/UNK_203,//無效果
	/*204*/UNK_204,//無效果
	/*205*/UNK_205,//無效果
	/*206*/UNK_206,//保護膜
	/*207*/UNK_207,//斗篷衣服都沒了的效果
	/*208*/UNK_208,//斗篷衣服都沒了的效果
	/*209*/UNK_209,//斗篷衣服都沒了的效果
	/*210*/UNK_210,//斗篷衣服都沒了的效果
	/*211*/UNK_211,//無效果
	/*212*/UNK_212,//無效果
	/*213*/UNK_213,//無效果
	/*214*/UNK_214,//無效果
	/*215*/UNK_215,//黑暗光效從角色腳底升起
	/*216*/UNK_216,//無效果
	/*217*/UNK_217,//紫色光效從角色腳底升起
	/*218*/HANBOK,//韓服
	/*219*/UNK_219,//身體結冰
	/*220*/UNK_220,//頭上一顆草
	/*221*/UNK_221,//頭上一棵草 1片葉子
	/*222*/UNK_222,//lineageII的標誌在角色頭上漂浮
	/*223*/UNK_223,//一個動作
	/*224*/UNK_224,//類似英雄光效 不過是黑色的
	/*225*/UNK_225,//類似英雄光效 不過是黑色的
	/*226*/UNK_226,//類似英雄光效 不過是黑色的
	/*227*/UNK_227,//類似英雄光效 不過是黑色的
	/*228*/UNK_228,//類似英雄光效 不過是黑色的
	/*229*/UNK_229,//身體發出圈圈光效 音符從腳底升起
	/*230*/UNK_230,//腳底一個藍色圈在轉動
	/*231*/UNK_231,//腳底一個黃色圈在轉動
	/*232*/TEDDY_BEAR,//熊熊娃
	/*233*/UNK_233,//無效果
	/*234*/WHITE_KNIGHT,//雪白騎士
	/*235*/UNK_235,//藍色保護膜
	/*236*/UNK_236,//超大藍色保護膜
	/*237*/UNK_237,//超大紅色保護膜
	/*238*/UNK_238,//無效果
	/*239*/UNK_239,//無效果
	/*240*/UNK_240,//無效果
	/*241*/UNK_241,//無效果
	/*242*/UNK_242,//無效果
	/*243*/UNK_243,//無效果
	/*244*/UNK_244,//無效果
	/*245*/UNK_245,//無效果
	/*246*/UNK_246,//無效果
	/*247*/UNK_247,//偵測之盾 覺醒
	/*248*/UNK_248,//集結盾 覺醒
	/*249*/UNK_249,//手環光圈
	/*250*/UNK_250,//九龍護盾效果
	/*251*/UNK_251,//腳環藍色光圈
	/*252*/DRAGON_BARRIER,//龍之屏障
	/*253*/KAT_THE_CATS,//戰鬥貓
	/*254*/UNK_254,//保護膜
	/*255*/UNK_255,//無效果
	/*256*/UNK_256,//無效果
	/*257*/UNK_257,//無效果
	/*258*/UNK_258,//無效果
	/*259*/UNK_259,//無效果
	/*260*/UNK_260,//無效果
	/*261*/CAT,//貓咪娃娃
	/*262*/PANDA,//熊貓娃娃
	/*263*/UNK_263,//無效果
	/*264*/UNK_264,//無效果
	/*265*/UNK_265,//無效果
	/*266*/UNK_266,//漂浮角色頭頂 狐狸雨淋的效果
	/*267*/UNK_267,//漂浮角色頭頂 狐狸開心的效果
	/*268*/UNK_268,//漂浮角色頭頂 狐狸勝利的效果
	/*269*/UNK_269,//漂浮角色頭頂 獎牌？
	/*270*/UNK_270,//漂浮角色頭頂 白狐狸滑冰
	/*271*/UNK_271,//漂浮角色頭頂 雪橇車
	/*272*/UNK_272,//漂浮角色頭頂 白狐狸提藍色燈籠
	/*273*/DRAGON_BERSERKER,//狂龍戰士衣裳
	/*274*/NINJA_ASSASSIN,//忍者刺客衣裳
	/*275*/BLUE_MUSKETEER,//藍色步兵衣裳
	/*276*/VALKYRIE,//女武神衣裳
	/*277*/WILD_WOLF,//野蠻狼衣裳
	/*278*/PIRATE,//商隊衣裳
	/*279*/PURPLE_COWBOY,//紫色牛仔衣裳
	/*280*/HIGH_PRIEST,//牧師衣裳
	/*281*/BLOOD_NOBLESSE,//血色貴族衣裳
	/*282*/WHITE_NOBLESSE,//白色貴族衣裳
	/*283*/UNK_283,//角色產生血紅色球往下掉
	/*284*/UNK_284,//角色產生紫黑色球往下掉
	/*285*/UNK_285,//無效果
	/*286*/UNK_286,//漂浮角色頭頂 一顆紅心
	/*287*/UNK_287,//無效果
	/*288*/UNK_288,//無效果
	/*289*/UNK_289,//無效果
	/*290*/UNK_290,//無效果
	/*291*/UNK_291,//角色產生藍黑色球往下掉
	/*292*/UNK_292,//漂浮角色頭頂 說不出什麼東西
	/*293*/UNK_293,//漂浮角色頭頂 說不出什麼東西
	/*294*/UNK_294,//無效果
	/*295*/UNK_295,//無效果
	/*296*/UNK_296,//角色被水柱衝到空中
	/*297*/UNK_297,//角色附近產生藍色龍捲風
	/*298*/UNK_298,//角色附近產生紅色龍捲風 夾雜 羽毛
	/*299*/UNK_299,//無效果
	/*300*/UNK_300,//無效果
	/*301*/UNK_301,//無效果
	/*302*/UNK_302,//綠色保護膜
	/*303*/UNK_303,//無效果
	/*304*/UNK_304,//無效果
	/*305*/UNK_305,//無效果
	/*306*/UNK_306,//無效果
	/*307*/UNK_307,//無效果
	/*308*/UNK_308,//無效果
	/*309*/UNK_309,//無效果
	/*310*/UNK_310,//無效果
	/*311*/UNK_311,//無效果
	/*312*/UNK_312,//無效果
	/*313*/UNK_313,//無效果
	/*314*/UNK_314,//無效果
	/*315*/UNK_315,//無效果
	/*316*/UNK_316,//無效果
	/*317*/UNK_317,//無效果
	/*318*/UNK_318,//無效果
	/*319*/UNK_319,//無效果
	/*320*/UNK_320,//無效果
	/*321*/UNK_321,//無效果
	/*322*/UNK_322;//藍色泳裝

	public static final AbnormalEffect[] VALUES = values();

	private final int _id;

	private AbnormalEffect()
	{
		_id = ordinal();
	}

	private AbnormalEffect(int id)
	{
		_id = id;
	}

	public final int getId()
	{
		return _id;
	}

	public final String getName()
	{
		return toString();
	}
}